TexasInstruments/mcupsdk-core/test/examples/drivers/epwm/epwm_diode_emulation/am263x-lp/r5fss0-0_nortos/example.syscfg
icl_xbar1.$name      = "CONFIG_ICL_XBAR0";
icl_xbar1.xbarOutput = ["MDL1_OUTA"];

input_xbar1.$name      = "CONFIG_INPUT_XBAR0";
input_xbar1.xbarOutput = "GPIO43";

input_xbar2.$name      = "CONFIG_INPUT_XBAR1";
input_xbar2.instance   = "INPUT_XBAR_1";
input_xbar2.xbarOutput = "GPIO45";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["EPWM0_INT"];

int_xbar2.$name      = "CONFIG_INT_XBAR1";
int_xbar2.xbarOutput = ["EPWM1_INT"];
int_xbar2.instance   = "INT_XBAR_1";

int_xbar3.$name      = "CONFIG_INT_XBAR2";
int_xbar3.xbarOutput = ["EPWM6_TZINT"];
int_xbar3.instance   = "INT_XBAR_2";

output_xbar1.$name              = "CONFIG_OUTPUT_XBAR0";
output_xbar1.xbarOutput         = ["EPWM4_SYNCOUT"];
output_xbar1.OUTPUTXBAR.$assign = "OUTPUTXBAR13";
output_xbar1.xbarConfig.$name   = "CONFIG_EPWM_SYNCOUT_XBAR0";

output_xbar2.$name              = "CONFIG_OUTPUT_XBAR1";
output_xbar2.xbarOutput         = ["DEL6_TRIP"];
output_xbar2.OUTPUTXBAR.$assign = "OUTPUTXBAR14";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution                       = "EPWM0_A";
epwm1.EPWM.B.$suggestSolution                       = "EPWM0_B";
epwm2.EPWM.A.$suggestSolution                       = "EPWM1_A";
epwm3.EPWM.A.$suggestSolution                       = "EPWM2_A";
epwm3.EPWM.B.$suggestSolution                       = "EPWM2_B";
epwm4.EPWM.A.$suggestSolution                       = "EPWM3_A";
epwm4.EPWM.B.$suggestSolution                       = "EPWM3_B";
epwm5.EPWM.A.$suggestSolution                       = "EPWM9_A";
epwm5.EPWM.B.$suggestSolution                       = "EPWM9_B";
epwm6.EPWM.A.$suggestSolution                       = "EPWM11_A";
epwm6.EPWM.B.$suggestSolution                       = "EPWM11_B";
epwm7.EPWM.A.$suggestSolution                       = "EPWM12_A";
epwm7.EPWM.B.$suggestSolution                       = "EPWM12_B";
debug_log.uartLog.UART.$suggestSolution             = "UART0";
output_xbar1.OUTPUTXBAR.OUTPUTXBAR.$suggestSolution = "PR0_PRU1_GPIO19";
output_xbar2.OUTPUTXBAR.OUTPUTXBAR.$suggestSolution = "PR0_PRU1_GPIO18";
